# 학생 5명의 국어, 영어 점수
s1 <- c(70, 65)
s2 <- c(90, 95)
s3 <- c(65, 60)
s4 <- c(85, 90)
s5 <- c(60, 75)
s_all <- rbind(s1, s2, s3, s4, s5)
s_all
#############################################################
# 맨해튼 거리
dist1 <- as.matrix(dist(s_all, method = "manhattan"))
dist1
#############################################################
# 유클리드 거리
dist2 <- as.matrix(dist(s_all, method = "euclidean"))
dist2
#############################################################
# install.packages("proxy")
library(proxy)
# 코사인 거리
dist3 <- as.matrix(dist(s_all, method="cosine"))
dist3
#############################################################
a <- c(1, 0 ,5)
b <- c(4, 7, 3)
c <- c(40, 70, 30) # b의 10배(b와 c의 코사인 유사도는 1, 코사인 거리는 0)
items <- rbind(a, b, c) # 행 결합
colnames(itmes) <- c("v1", "v2", "v3")
items
#############################################################
# 코사인 거리 계산(1 - 코사인유사도)
# 두벡터의 값이 같은 방향, 같은 배수로 증가할 경우 코사인 거리는 0, 코사인 유사도는 1
dist4 <- as.matrix(dist(items, method="cosine"))
dist4
